package com.example.memorygames.Survey;

public class Questions_db {

    private String mQuestions []={
            "Νομίζω ότι θα ήθελα να χρησιμοποιώ αυτά τα παιχνίδια συχνά.",
            "Βρήκα αυτά τα παιχνίδια αδικαιολόγητα περίπλοκα.",
            "Σκέφτηκα ότι αυτά τα παιχνίδια ήταν εύκολα στη χρήση.",
            "Νομίζω ότι θα χρειαστώ βοήθεια από κάποιον ειδικό για να μπορέσω να χρησιμοποιήσω αυτά τα παιχνίδια.",
            "Βρήκα τις διάφορες λειτουργίες σ’ αυτά τα παιχνίδια καλά ενσωματωμένες.",
            "Σκέφτηκα ότι υπήρχε μεγάλη ασυνέπεια στη λειτουργία των παιχνιδιών .",
            "Φαντάζομαι ότι οι περισσότεροι άνθρωποι θα μάθουν να χρησιμοποιούν αυτά τα παιχνίδια πολύ γρήγορα.",
            "Βρήκα αυτά τα παιχνίδια πολύ δύσκολα/περίπλοκα στη χρήση.",
            "Ένιωσα πολύ σίγουρος/η χρησιμοποιώντας αυτά τα παιχνίδια.",
            "Χρειάστηκε να μάθω πολλά πράγματα πριν να μπορέσω να ξεκινήσω με αυτά τα παιχνίδια."
    };

    public String getQuestions(int a) {

        String questions=mQuestions[a];
        return questions;
    }



}
